// Class 설계도 만들기

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //

class Person {
    // 사람의 필수 요소
    // name, age
    constructor(name, age) {
        this.name = name;
        this.age = age;
    }

    // 메서드 형태의 동사 표현
    sayHello() {
        console.log(`${this.name}님 안녕하세요!`);
    }

    // 내 나이는 ~살입니다! 라고 출력하는 메서드 만들기
    printMyAge() {
        console.log(`${this.name}님 나이는 ${this.age}살입니다.`);
    }
}

// 설계도를 통해서 인스턴스(실제 사물) 만들기
// 이름은 홍길동, 나이는 30살인 사람을 하나  만들어줘! (설계도에 근거해서)
const Person1 = new Person("홍길동", "30");
const Person2 = new Person("홍길순", "25");
const Person3 = new Person("홍길자", "50");

Person1.sayHello();
Person2.sayHello();
Person3.printMyAge();

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //
