// 클로저
// A closure is the combination of a function and the lexical environment within which that function was declared
// 즉, 함수와 그 함수가 선언된 렉시컬 환경과의 조화이다.

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //

const x = 1;

function outerFunc() {
    const x = 10;
    function innerFunc() {
        // x는 어디서 참조할까?
        // 함수가 선언된 렉시컬 환경에서 참조한다.
        // 즉, 함수가 선언되는 당시의 외부 변수 등의 정보에서 참조한다.
        console.log(x); // 출력값 : 10
    }

    innerFunc();
}

outerFunc();

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //
