// 무슨 제어권?

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //

// 2. 인자에 대한 제어권을 갖는다.
// map : 배열에 대한 메서드(기존 배열은 유지하되, 새로운 배열을 생성함)

// index : 사람이 이해할 수 있는 변수명일 뿐
// currentValue : 사람이 이해할 수 있는 변수명일 뿐
// 즉, 현재 currentValue는 index 자리에 있기 때문에 index로 인식하여 index 번호에 +5씩 증가됨

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //

var newArr = [10, 20, 30].map(function (index, currentValue) {
    console.log(index, currentValue);
    return currentValue + 5;
});

console.log(newArr);

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //
