// 일급 객체로서의 함수 (2)

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //

// const person = {
//     name: "John",
//     age: 31,
//     isMarried: true,

//     sayHello: function () {
//         console.log(`Hello, My name is ${this.name}`);
//         // console.log("Hello, My name is " + this.name);
//     },

//     // sayHello: () => {
//     //     console.log(`Hello, My name is ${this.name}`);
//     //     // 화살표 함수는 tihs를 바인딩 하지 않기 때문에 undefined로 출력된다.
//     // },
// };

// person.sayHello();

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //

// 메서드(함수)에서 사용하는 this는 호출 주체에 따라 달라지게 된다.
// 메서드를 호출할 때, "해당 메서드의 호출 주체(ex: 객체)를 this라는 것으로 엮는다"를 바인딩이라고 표현한다.
// 하지만 화살표함수는 처음부터 this 바인딩 절차가 생략되게끔 설계되었다.

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //
