// 변수, 상수

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //

// 변수의 5가지 주요 개념
// 변수 이름 : 저장된 값의 고유 이름
// 변수 값 : 변수에 저장된 값
// 변수 할당 : 변수에 값을 저장하는 행위
// 변수 선언 : 변수를 사용하기 위해 컴퓨터에 알리는 행위
// 변수 참조 : 변수에 할당된 값을 읽어오는 것

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //

// 변수를 선언할 수 있는 3가지 방법 : var, let, const

// 1. var
var myVar = "Hello World1";
var myVar = "Test1";
myVar = "GoodBye1";
console.log(myVar);

// 2. let
let myLet = "Hello World2";
// let myLet = "Test2";
myLet = "GoodBye2";
console.log(myLet);

// 3. const
const myConst = "Hello World3";
// const myConst = "Test3";
// myConst = "GoodBye3";
console.log(myConst);

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //

// var는 똑같은 이름으로 다시 선언할 수 있지만, let/const는 다시 선언할 수 없다.
// var/let은 재할당을 할 수 있지만, const는 재할당이 안 된다.

// ------------------------------------------------------------------------------------------------------------------------------------------------------------------ //
